# AmericaSave Mortgage

## Import and connect to the database

In [1]:
import sqlite3

In [2]:
# Connect to the SQLite database (or create it if it doesn't exist)
conn = sqlite3.connect('my_database.db')
cursor = conn.cursor()

In [3]:
%load_ext sql
%sql sqlite:///my_database.db

Connecting to 'sqlite:///my_database.db'

In [4]:
# Delete all tables from the database. This is useful when rerunning the notebook.

In [5]:
# Get all user-defined tables (excluding internal SQLite tables)
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%';")
tables = cursor.fetchall()

# Drop each table
for table in tables:
    cursor.execute(f"DROP TABLE IF EXISTS {table[0]};")

In [6]:
# Read the tables
table_list = ['assignment_history SQL Table.txt', 'bookings SQL Table.txt', 'space_travel_agents SQL Table.txt']

for t in table_list:
    with open(t, 'r') as f:
        script = f.read()
    cursor.executescript(script)

In [7]:
## Merge table bookings and assignment_history so that bookings have information of AgentID

In [8]:
%%sql

CREATE TABLE bookings_2 AS
SELECT B.*,
        AH.AgentID
FROM bookings AS B
LEFT JOIN assignment_history AS AH USING(AssignmentID)

Running query in 'sqlite:///my_database.db'

++
||
++
++

## Update loads and agent_ranking

In [9]:
%%sql 

ALTER TABLE space_travel_agents
ADD COLUMN load INTEGER DEFAULT 0;

ALTER TABLE space_travel_agents
ADD COLUMN agent_rank INTEGER;

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [10]:
%%sql
UPDATE space_travel_agents
SET load = load + (
  SELECT COUNT(*)
  FROM bookings_2
  WHERE bookings_2.AgentID = space_travel_agents.AgentID
    AND bookings_2.BookingStatus = 'Pending'
)

Running query in 'sqlite:///my_database.db'

30 rows affected.

++
||
++
++

In [11]:
%%sql

UPDATE space_travel_agents
SET agent_rank = (
  SELECT COUNT(*)
  FROM space_travel_agents AS b
  WHERE b.load < space_travel_agents.load
     OR (b.load = space_travel_agents.load AND b.YearsOfService > space_travel_agents.YearsOfService)
     OR (b.load = space_travel_agents.load AND b.YearsOfService = space_travel_agents.YearsOfService AND b.AverageCustomerServiceRating > space_travel_agents.AverageCustomerServiceRating)
) + 1;

Running query in 'sqlite:///my_database.db'

30 rows affected.

++
||
++
++

In [12]:
%sql SELECT * FROM space_travel_agents LIMIT 5

Running query in 'sqlite:///my_database.db'

+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
| AgentID | FirstName |  LastName |            Email            |          JobTitle         |    DepartmentName    |  ManagerName  | SpaceLicenseNumber | YearsOfService | AverageCustomerServiceRating | load | agent_rank |
+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
|    1    |   Aurora  |   Tanaka  | aurora.tanaka@astra2081.com | Senior Space Travel Agent | Interplanetary Sales |   Lyra Chen   |    SL-2081-001     |       12       |             4.0              |  0   |     5      |
|    2    |    Kai    | Rodriguez | kai.rodriguez@astra2081.com |     Space Travel Agent    |    Luxury Voyages    |   Lyra Chen   |    SL-2081-002     |       7        |             4.0              |  1   |     21     |
|    3    |    Nova   |   Singh   |   nova.singh@astra2081.com  | Senior Space Travel Agent |   Premium Bookings   | Zane Holloway |    SL-2081-003     |       15       |             4.0              |  0   |     2      |
|    4    |    Leo    |    Kim    |    leo.kim@astra2081.com    |     Space Travel Agent    | Interplanetary Sales |   Lyra Chen   |    SL-2081-004     |       5        |             4.0              |  0   |     10     |
|    5    |    Vera   |   Nguyen  |  vera.nguyen@astra2081.com  |     Space Travel Agent    |    Luxury Voyages    | Zane Holloway |    SL-2081-005     |       3        |             3.9              |  1   |     24     |
+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+

## Create trigger to update agent_ranking

In [13]:
%%sql

CREATE TABLE IF NOT EXISTS agent_rank_tracker (
  AgentID INTEGER PRIMARY KEY,
  agent_rank INTEGER 
);

INSERT INTO agent_rank_tracker (AgentID, agent_rank)
  SELECT a.AgentID,
         (
           SELECT COUNT(*)
           FROM space_travel_agents AS b
           WHERE b.load < a.load
              OR (b.load = a.load AND b.YearsOfService > a.YearsOfService)
              OR (b.load = a.load AND b.YearsOfService = a.YearsOfService AND b.AverageCustomerServiceRating > a.AverageCustomerServiceRating)
         ) + 1
  FROM space_travel_agents AS a;

Running query in 'sqlite:///my_database.db'

30 rows affected.

++
||
++
++

In [14]:
%sql SELECT * FROM agent_rank_tracker

Running query in 'sqlite:///my_database.db'

+---------+------------+
| AgentID | agent_rank |
+---------+------------+
|    1    |     5      |
|    2    |     21     |
|    3    |     2      |
|    4    |     10     |
|    5    |     24     |
|    6    |     1      |
|    7    |     23     |
|    8    |     19     |
|    9    |     28     |
|    10   |     15     |
+---------+------------+
Truncated to displaylimit of 10.

In [15]:
%%sql
    
CREATE TRIGGER update_agent_load_subtracting
AFTER UPDATE OF BookingStatus ON bookings_2
BEGIN
    -- Update agent load
    UPDATE space_travel_agents
    SET load = CASE
        WHEN load > 0 THEN load - 1
        ELSE 0
    END
    WHERE AgentID = NEW.AgentID
    AND OLD.BookingStatus = 'Pending'
    AND NEW.BookingStatus IN ('Confirmed', 'Rejected');

END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [16]:
%%sql
    
CREATE TRIGGER update_agent_load_adding
AFTER INSERT ON bookings_2
FOR EACH ROW
BEGIN

    UPDATE space_travel_agents
    SET load = load + 1
    WHERE AgentID = NEW.AgentID
    AND NEW.BookingStatus = 'Pending';

END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

## Add a new table, named new_customer

In [17]:
%%sql
CREATE TABLE new_customer (
    CustomerName VARCHAR(100) PRIMARY KEY,
    CommunicationMethod VARCHAR(50) NOT NULL CHECK (CommunicationMethod IN ('Phone Call', 'Text')),
    LeadSource VARCHAR(50) NOT NULL CHECK (LeadSource IN ('Organic', 'Bought')),
    Destination VARCHAR(50) NOT NULL CHECK (Destination IN ('Mars', 'Europa', 'Titan', 'Venus', 'Ganymede')),
    LaunchLocation VARCHAR(200) NOT NULL CHECK (LaunchLocation IN ('Dallas-Fort Worth Launch Complex', 
    'New York Orbital Gateway', 'Dubai Interplanetary Hub',
    'Tokyo Spaceport Terminal', 'London Ascension Platform', 'Sydney Stellar Port'))
    )

Running query in 'sqlite:///my_database.db'

++
||
++
++

## Step 1: Update assignment_history

In [18]:
%%sql
CREATE TRIGGER updating_customer
AFTER INSERT ON new_customer
FOR EACH ROW
BEGIN

  -- Insert assignment_history
  INSERT INTO assignment_history (
    CustomerName,
    AssignmentID,
    CommunicationMethod,
    LeadSource,
    AssignedDateTime,
    AgentID
  )
  VALUES (
    NEW.CustomerName,
    (SELECT IFNULL(MAX(AssignmentID), 0) + 1 FROM assignment_history),
    NEW.CommunicationMethod,
    NEW.LeadSource,
    datetime('now', '+56 years'),
    (SELECT AgentID FROM agent_rank_tracker ORDER BY agent_rank LIMIT 1)
  );
END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

## Add bookings

In [19]:
%%sql
CREATE TRIGGER add_bookings_on_assignment
AFTER INSERT ON assignment_history
FOR EACH ROW
BEGIN
  INSERT INTO bookings_2 (
    BookingID,
    AssignmentID,
    Destination,
    LaunchLocation,
    BookingStatus,
    AgentID
  )
  VALUES (
    (SELECT IFNULL(MAX(BookingID), 0) + 1 FROM bookings_2),
    NEW.AssignmentID,
    (SELECT Destination FROM new_customer WHERE CustomerName = NEW.CustomerName),
    (SELECT LaunchLocation FROM new_customer WHERE CustomerName = NEW.CustomerName),
    'Pending',
    NEW.AgentID
  );
END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

## Trigger updating load

In [20]:
%%sql

CREATE TRIGGER increment_agent_load_on_booking
AFTER INSERT ON bookings_2
FOR EACH ROW
BEGIN
  UPDATE space_travel_agents
  SET load = load + 1
  WHERE AgentID = NEW.AgentID AND NEW.BookingStatus = 'Pending';
END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

## Recomputing agent_rank

In [21]:
%%sql
    
CREATE TRIGGER recompute_agent_rank_on_load
AFTER UPDATE OF load ON space_travel_agents
FOR EACH ROW
BEGIN
  DELETE FROM agent_rank_tracker;

  INSERT INTO agent_rank_tracker (AgentID, agent_rank)
  SELECT a.AgentID,
         (
           SELECT COUNT(*)
           FROM space_travel_agents AS b
           WHERE b.load < a.load
              OR (b.load = a.load AND b.YearsOfService > a.YearsOfService)
              OR (b.load = a.load AND b.YearsOfService = a.YearsOfService
                  AND b.AverageCustomerServiceRating > a.AverageCustomerServiceRating)
         ) + 1
  FROM space_travel_agents AS a;
END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

## Insert new rows to "new_customer"

In [22]:
%%sql

INSERT INTO new_customer (CustomerName, CommunicationMethod, LeadSource, Destination, LaunchLocation)
VALUES ('Kate Nguyen', 'Text', 'Organic', 'Mars', 'Dallas-Fort Worth Launch Complex'),
('Jonh Doe', 'Phone Call', 'Bought', 'Europa', 'Sydney Stellar Port')

Running query in 'sqlite:///my_database.db'

2 rows affected.

++
||
++
++

In [23]:
%sql SELECT * FROM assignment_history ORDER BY AssignmentID DESC

Running query in 'sqlite:///my_database.db'

+--------------+---------+-----------------+---------------------+------------+---------------------+
| AssignmentID | AgentID |   CustomerName  | CommunicationMethod | LeadSource |   AssignedDateTime  |
+--------------+---------+-----------------+---------------------+------------+---------------------+
|     452      |    3    |     Jonh Doe    |      Phone Call     |   Bought   | 2081-07-10 20:21:21 |
|     451      |    6    |   Kate Nguyen   |         Text        |  Organic   | 2081-07-10 20:21:21 |
|     450      |    11   |    Mira Cruz    |      Phone Call     |   Bought   | 2081-04-10 15:00:00 |
|     449      |    20   |    Arlo King    |         Text        |  Organic   | 2081-04-10 13:50:00 |
|     448      |    2    |   Tinsley Ross  |         Text        |   Bought   | 2081-04-10 12:40:00 |
|     447      |    16   |   Elowen Bell   |      Phone Call     |  Organic   | 2081-04-10 11:30:00 |
|     446      |    24   | Callahan Rivera |         Text        |   Bought   | 2081-04-10 10:20:00 |
|     445      |    7    |   Kylan Scott   |         Text        |  Organic   | 2081-04-10 09:10:00 |
|     444      |    28   |    Zya Lewis    |      Phone Call     |   Bought   | 2081-04-09 14:55:00 |
|     443      |    13   |  Azalea Brooks  |         Text        |  Organic   | 2081-04-09 13:45:00 |
+--------------+---------+-----------------+---------------------+------------+---------------------+
Truncated to displaylimit of 10.

In [24]:
%sql SELECT * FROM agent_rank_tracker

Running query in 'sqlite:///my_database.db'

+---------+------------+
| AgentID | agent_rank |
+---------+------------+
|    1    |     3      |
|    2    |     19     |
|    3    |     26     |
|    4    |     8      |
|    5    |     22     |
|    6    |     24     |
|    7    |     21     |
|    8    |     17     |
|    9    |     28     |
|    10   |     13     |
+---------+------------+
Truncated to displaylimit of 10.